app/controllers/comments_controller.rb

  def index
    @post = Post.find(params[:post_id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 4)

  def show
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 4)
SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 4))

  def new
    @post = Post.find(params[:post_id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 4)

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.build(params[:comment])
    if @comment.save
---
SELECT * FROM "posts" WHERE ("posts"."id" = 4)
INSERT INTO "comments" ("post_id", "updated_at", "commenter", "body", "created_at") VALUES(4, '2015-10-03 14:12:43', 'Alex', 'What''s that crappy post is?', '2015-10-03 14:12:43')

  def edit
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."id" = 1 AND ("comments".post_id = 1))

  def update
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    if @comment.update_attributes(params[:comment])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
UPDATE "comments" SET "body" = 'At last I''ve done it! Yahoo!!!', "updated_at" = '2015-10-06 18:32:06' WHERE "id" = 1

  def destroy
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM "posts" WHERE ("posts"."id" = 5)
SELECT * FROM "comments" WHERE ("comments"."id" = 6)
DELETE FROM "comments" WHERE "id" = 6