app/controllers/home_controller.rb

  def index
    @posts = Post.all({:select => 'posts.*, COUNT(comments.id) as comments_count', :joins => [:comments], :group => 'posts.id', :order => 'comments_count DESC', :limit => 3})
---
SELECT count(*) AS count_all FROM "comments" WHERE ("comments".post_id = 4)
SELECT posts.*, COUNT(comments.id) as comments_count FROM "posts" INNER JOIN "comments" ON comments.post_id = posts.id GROUP BY posts.id ORDER BY comments_count DESC LIMIT 3