app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("updated_at", "content", "created_at", "name", "title", "comments_count") VALUES('2015-10-06 22:52:41', ''';j'';kj'';kj''k;nj''kn''kln', '2015-10-06 22:52:41', 'Alex', 'Place 3', NULL)

  def update
    respond_to do |format|
      if @post.update_attributes(params[:post])
---
UPDATE "posts" SET "updated_at" = '2015-10-03 14:03:01', "name" = 'Alalalabebebebebe' WHERE "id" = 3

  def destroy
    @post.destroy
---
DELETE FROM "posts" WHERE "id" = 1